tutorials/Accuracy/SIPM-M/caseA-dt=0.0025s/system/cavity/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
)

application     multiChtFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0025;

writeControl    timeStep;

writeInterval   4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  off;

maxCo           0.5;

/*functions
(
    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;

        K              kappaEff;
    }
    heatFlux
    {
        // Type of functionObject
        type heatFlux;
        outputControl timeStep;
        outputInterval 1;
        region solid;

        K              k;
    }
);*/


// ************************************************************************* //
